OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f4550.h
//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot block (000000-0007FFh) is code-protected.
#define _CPB_OFF_5H             0xFF    // Boot block (000000-0007FFh) is not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM is code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM is not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000800-001FFFh) is write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000800-001FFFh) is not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (002000-003FFFh) is write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (002000-003FFFh) is not write-protected.
#define _WRT2_ON_6L             0xFB    // Block 2 (004000-005FFFh) is write-protected.
#define _WRT2_OFF_6L            0xFF    // Block 2 (004000-005FFFh) is not write-protected.
#define _WRT3_ON_6L             0xF7    // Block 3 (006000-007FFFh) is write-protected.
#define _WRT3_OFF_6L            0xFF    // Block 3 (006000-007FFFh) is not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) are write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) are not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot block (000000-0007FFh) is write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot block (000000-0007FFh) is not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM is write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM is not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (000800-001FFFh) is protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (002000-003FFFh) is protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks.
#define _EBTR2_ON_7L            0xFB    // Block 2 (004000-005FFFh) is protected from table reads executed in other blocks.
#define _EBTR2_OFF_7L           0xFF    // Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks.
#define _EBTR3_ON_7L            0xF7    // Block 3 (006000-007FFFh) is protected from table reads executed in other blocks.
#define _EBTR3_OFF_7L           0xFF    // Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot block (000000-0007FFh) is protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot block (000000-0007FFh) is not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18F4550_H__
